const lessonsData = Array.from({ length: 34 }, (_, i) => ({
  id: i + 1,
  title: `Сабақ ${i + 1}`,
  intro: `Бұл ${i + 1}-сабақтың қысқаша сипаттамасы.`,
  content: `
Бұл ${i + 1}-сабақтың НЕГІЗГІ материалы.
Мұнда теория, мысалдар, суреттер болады.
  `,
  quiz: [
    {
      question: "Нейрондық желі дегеніміз не?",
      options: [
        "Деректер базасы",
        "Алгоритмдер жиынтығы",
        "Адам миының математикалық моделі",
        "Бағдарламалау тілі",
      ],
      correctIndex: 2,
    },
    {
      question: "Нейрон не істейді?",
      options: [
        "Сақтайды",
        "Салыстырады",
        "Сигнал қабылдап, өңдейді",
        "Файл жүктейді",
      ],
      correctIndex: 2,
    },
    {
      question: "Кіріс деректер қалай аталады?",
      options: ["Output", "Weight", "Input", "Bias"],
      correctIndex: 2,
    },
    {
      question: "Activation function не үшін керек?",
      options: [
        "Дерек сақтау үшін",
        "Сызықтық емес болу үшін",
        "Файл ашу үшін",
        "Код жазу үшін",
      ],
      correctIndex: 1,
    },
    {
      question: "Нейрондық желі қай салада қолданылады?",
      options: [
        "Тек математикада",
        "Тек физикада",
        "Көптеген салаларда",
        "Еш жерде",
      ],
      correctIndex: 2,
    },
  ],
}));

export default lessonsData;
